src/Assets/AmadeusRequestTemplates/GetPNR.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <AuthenticationSoapHeader xmlns="http://epowerv5.amadeus.com.tr/WS">
      <WSUserName>{{WSUserName}}</WSUserName>
      <WSPassword>{{WSPassword}}</WSPassword>
    </AuthenticationSoapHeader>
  </soap:Header>
  <soap:Body>
    <GetPNR xmlns="http://epowerv5.amadeus.com.tr/WS">
      <OTA_ReadRQ>
        <ReadRequests>
          <ReadRequest>
            <BookingReferenceID Type="{{PNRType}}" ID_Context="{{PNR}}" />
            <Verification>
              <PersonName>
                <Surname>{{leadLastName}}</Surname>
              </PersonName>
            </Verification>
          </ReadRequest>
        </ReadRequests>
      </OTA_ReadRQ>
    </GetPNR>
  </soap:Body>
</soap:Envelope>